[
  {
    "posting_id": 1,
    "company_id": 1,
    "position_id": 1,
    "content": "Front-end 웹 기술 언어(HTML, CSS, JavaScript, WebAssembly)를 활용하여 사용자와 서비스 사이의 다리를 놓습니다. 사용자와 시스템의 상호 작용을 돕기 위해 웹 브라우저 등 다양한 플랫폼과의 웹 호환이 가능한 어플리케이션을 개발합니다."
  },

  {
    "posting_id": 2,
    "company_id": 1,
    "position_id": 2,
    "content": "저희 부서는 외부 전문가들과 협력하여 Vertical 서비스에 도움을 줄 수 있는 AI 기술 연구 및 관련 서비스 플랫폼을 개발하고 있습니다. AI 에이전트에 대해 세계 최고의 선도적 기술 개념을 제시하고 이를 실제 비즈니스 현장에서 실현하고자 하는 조직으로서 특히 생성형 AI를 기반으로 다양한 파트너와 고객의 니즈를 유연하고 신속하게 반영할 수 있는 기술을 개발하고 이러한 기술들이 현장에 널리 보급될 수 있도록 유용한 서비스 플랫폼을 제공하고자 합니다., 담당 업무: 서비스 백엔드 설계, 구현 및 운영, 백엔드 아키텍처 및 DB 설계, 기획, 프론트, AI 담당 팀원들과의 협업을 통한 백엔드 기능 구현, 사내/외 기술 플랫폼 연동을 통한 개발 효율화, 배포 및 운영을 위한 CI/CD 환경 구축, 외부 공개를 위한 코드 경량화 및 보안 작업, 협력 연구원 및 파트너의 의견을 반영한 기술적 지원 및 피드백 관리, 동료 연구자 및 사업 부서와의 원활한 소통을 통해 프로젝트 진행 상황 및 결과 공유., 자격 요건: 2년 이상 개발 경력을 보유하신 분, Python 기반 웹개발 프레임워크를 활용한 백엔드 구현 경험을 보유하신 분, RDBMS 및 NoSQL기반 시스템 구현 및 쿼리 최적화 경험을 보유하신 분, Docker기반 CI/CD구축 및 배포 경험이 있으신 분, AI 관련 서비스 개발 프로젝트 경험이 있으신 분, 클라우드 환경에 대한 높은 이해도가 있으신 분, 최신기술을 접목하여 자기주도적으로 신규 서비스를 구현하는 데 관심이 있으신 분, AI 개발 도구를 활용하여 생산성을 높이는 것을 좋아하시는 분., 필요 스킬: Python에 대한 중급 이상의 이해도 및 숙련도, Java 또는 Kotlin 등 백엔드 최적화를 위한 개발 언어 역량, RDBMS 및 NoSQL에 대한 이해도 및 숙련도, AI 기술을 활용한 백엔드 시스템 개발 능력, 컨테이너 및 클라우드 환경에서의 개발 및 배포 역량, 문제의 구조화 및 문제 해결을 위한 전략적 접근 역량, 다양한 동료/파트너/이용자와의 원활한 소통 역량(문서 통한 소통 포함)., 우대 사항: FastAPI 기반 백엔드 설계 및 구현 경험이 있으신 분, Kubernetes기반 Cloud Native 시스템 개발 경험이 있으신 분, AI 에이전트 또는 챗봇 관련 프로젝트 수행 경험이 있으신 분, LLM 및 LangChain 활용한 프로젝트 경험이 있으신 분, NCP, AWS, GCP 등 클라우드 플랫폼 자격증을 보유하신 분, 사용자를 위한 실 서비스 개발 및 운영 경험이 있으신 분(트래픽 관리, 성능 최적화, 암호화 및 보안 대응 등)."
  },

  {
    "posting_id": 3,
    "company_id": 1,
    "position_id": 3,
    "content": "Who We Are • 네이버 멤버십은 고객을 위해 존재합니다. 고객의 입장에서 늘 생각하고 판단하며, 네이버의 경계를 넓히고 생태계를 활성화시키는 역할을 하고 있습니다. • 네이버플러스 멤버십을 통해 쇼핑, 페이, 웹툰, 클라우드 등 네이버의 다양한 서비스와 함께 OTT, 편의점, 영화관, 게임 등 외부 생태계를 잇고 있습니다. • 멤버십 프로그램의 전략과 실행을 총괄 및 주도하고 있으며, 구독 프로그램이 고객에 대한 이해를 바탕으로 네이버의 성장에 도움이 될 수 있도록 변화를 만들어내고 있습니다. 모집 부문 아래 모집 부문의 총 2개 직무 중 1개 직무에만 지원 가능하며 중복 지원은 불가합니다. 1. 네이버플러스 멤버십 서비스 기획 및 운영 What You'll Do 네이버플러스 멤버십 서비스의 프로덕트 오너로서 서비스 경험을 만드는 과정 전반을 담당하며 프로덕트를 출시하고, 운영 및 관리에 필요한 업무를 담당하게 됩니다. • 멤버십 사용자 경험 기획 및 운영 : 사용자 데이터 기반으로 서비스 과제를 도출하고, UI/UX 경험을 설계하고 개선합니다. • 쇼핑·페이 연계를 통한 혜택 체감도 강화 : 구매 여정 전반에 멤버십 혜택을 효과적으로 설계하고 운영합니다. • 온·오프라인 제휴 기반 혜택 설계 및 운영 : 일상 생활 속에서도 멤버십 혜택을 경험할 수 있도록 제휴를 통한 신규 혜택을 기획하고 운영 프로세스를 구축합니다. • 신규 가입자 유입 및 활동성 증대 기획 : 가입 전환율 개선 및 쇼핑 활동성 강화를 위한 사용자 여정을 기획합니다. • 서비스 정책 수립 및 리스크 관리 : 사용자 이슈 분석을 통해 정책을 정비하고 운영 리스크를 선제적으로 관리합니다. Required Skills • 서비스 전반에 대해 오너십을 가지고 프로덕트 론칭 및 관리할 역량을 보유하신 분 • 고객 활동성 지표를 중심으로 서비스 기획 및 관리한 경험을 보유하신 분 • 사용자 Journey 분석 및 고객 경험 개선 경험을 보유하신 분 • A/B 테스트를 통해 서비스 개선 및 유의미한 결과를 도출해 보신 분 Preferred Skills • 서비스 기획/운영 경험 12년 이상 보유하신 분 • 팀 리더 또는 다양한 직군(기획/개발/디자인/법무 등)과 협업하여 프로젝트를 주도한 경험을 보유하신 분 • 문제를 정의하고 능동적으로 해결하며, 명확한 커뮤니케이션으로 구성원과 원활하게 협업할 수 있는 분 • 주요 협업 툴(Figma, WIKI, JIRA 등) 사용 경험이 있으신 분 2. 네이버플러스 멤버십 혜택 설계 What You'll Do • 멤버십 신규 혜택 기획 및 중장기 성장 전략 방향 수립 • 국내외 멤버십 시장 상황 파악 및 데이터 기반 의사결정 지원 • 쇼핑, 적립, 콘텐츠 서비스 등 멤버십 전반의 이용 데이터를 분석하여 혜택 설계, 고객 확보 및 유지 전략 등 데이터 기반 의사결정 주도 Required Skills • 데이터를 기반으로 신규 사업 방향을 설계하거나 비즈니스 이슈 해결 경험이 있으신 분 • SQL을 활용한 데이터 추출 및 분석이 가능하며 인사이트 도출 경험이 있으신 분 • 비즈니스 문제 정의와 가설 수립, 검증 등의 분석 설계를 주도적으로 하실 수 있는 분 Preferred Skills • 구독 서비스·멤버십 프로그램 혜택 설계 또는 유관 경력 5년 이상 보유하신 분 • 구독 서비스 이용 관련 데이터 분석 경험을 보유하신 분 • 리텐션 분석, 코호트 분석, A/B 테스트 등 서비스 성과 분석 경험이 있으신 분 • 최근 글로벌 및 국내 구독 서비스 동향에 대한 인사이트 보유 및 트렌드 분석 경험이 있으신 분 • 시각화 도구(Tableau 등) 활용과 데이터 기반 보고서 작성 스킬을 보유하신 분"
  },

  {
    "posting_id": 4,
    "company_id": 1,
    "position_id": 4,
    "content": "저희 부서는 대형 언어 모델(LLM)을 활용하여 챗봇, 자동화 워크플로우, 대화형 시스템 등 혁신적인 에이전트 및 서비스를 개발하는 조직입니다. 최신 AI 기술 트렌드를 선도하며, 체계적인 실험 설계와 데이터 중심 접근을 통해 사용자 중심의 솔루션을 제공합니다. 모델링과 엔지니어링을 아우르는 유연한 업무 환경에서 디지털 전환을 가속화하는 것을 목표로 합니다., 담당 업무: 에이전트를 위한 다양한 도구들(메모리, 컨텍스트 압축, 에이전트를 위한 통신 아키텍처 등)의 성능을 아이디어화, 개발, 비교, 에이전트를 위한 프롬프트 엔지니어링 모범 사례 발견 및 테스트, 에이전틱 시스템 설계 및 평가를 위한 자동화 기법 개발, 에이전틱 시스템의 평가를 위한 빠른 시스템 프로토타이핑, 학습 및 제품 수명주기 전반에 걸친 HCX 모델과 프롬프트의 자동화된 평가 지원, 모델 학습을 위한 데이터 믹스 생성 및 최적화 지원, 효율적인 프롬프트 개선 싸이클에 필요한 인프라 생성 및 유지 관리 지원., 자격 요건: 국내/외 정규대학 AI/ML 분야 전공 석사 학위 보유 혹은 3년 이상의 유관 업무 경험이 있으신 분, 능숙한 Python 프로그래밍 기술을 보유하신 분, 대규모 언어 모델의 아키텍처와 작동에 대한 지식을 보유하신 분, 언어모델에 대한 프롬프팅 경험 혹은 언어모델을 이용한 프로덕트 개발 경험이 있으신 분, 좋은 의사소통 기술을 보유하고 어려운 작업에서 다른 동료들과 협력하는 데 관심이 있으신 분, 신흥 연구 및 산업 동향에 대한 적극적인 관심을 기반으로 최신 정보를 유지하고 정보를 습득하는 자세를 보유하신 분., 우대 사항: NextJs 혹은 유사한 FE framework를 이용한 fullstack 개발 경험을 보유하신 분, 언어 모델에 대한 finetuning 및 alignment 파이프라인 개발 경험을 보유하신 분, 멀티 에이전트 시스템 개발 경험을 보유하신 분."
  },

  {
    "posting_id": 5,
    "company_id": 1,
    "position_id": 5,
    "content": "콘텐츠 기업에 있어 불법 저작물 및 이를 유통하는 집단에 대한 대응은 사업의 성패가 걸린 영역입니다. ToonRadar는 데이터 및 기술적인 영역에서 웹툰 불법유출에 대응하고 있습니다. 매우 목적 지향적인 기술 조직으로, 불법유출을 막는데 필요한 다양한 기술을 시도 해볼 수 있습니다. 또한 사안에 따라 기술적이면서 중장기적으로 대응하는 영역과, 빠르게 결정하고 실행하는 단기적인 기술적 대응 영역이 공존합니다., 담당 업무: Anti-Abusing 관점에서 엔지니어와 데이터 사이언티스트 성격을 포괄하는 포지션입니다. ToonRadar 관련 웹툰 불법유출 대응 시스템을 고도화 하는 개발을 담당합니다. 불법유출 탐지 모델링 및 파이프라인 개발을 담당합니다. 불법유출 패턴 및 대응 효과 분석을 담당합니다., 필요 역량: 관련 업무를 5년 이상 담당해보신 분, Python 프로그래밍에 능숙하신 분, Python 기반 Workflow 및 데이터 파이프라인 도구 활용 경험(ex. Airflow)이 있으신 분, Python 기반 웹어플리케이션(Back-end, Front-end) 개발 경험이 있으신 분, MySQL, Redis, Kafka 등 활용 경험 및 데이터 분석(EDA) 능력이 있으신 분., 우대 사항: 실시간 스트리밍 데이터를 분석하여 모델을 개발하고 서빙해 본 경험이 있으신 분, FDS 혹은 그와 유사한 Anti-Abusing 시스템 개발/운영 경험이 있으신 분, Anomaly Detection 모델링 경험(룰베이스 또는 ML 기반)이 있으신 분, 인과추론 분석 및 모델링 경험이 있으신 분, 웹어플리케이션 취약점 분석/대응 경험 및 리버스 엔지니어링 능력이 있으신 분, 저작권 침해 또는 어뷰징에 대한 중장기적인 기술적 대응 전략 수립 및 기획 경험이 있으신 분."
  },

  {
    "posting_id": 6,
    "company_id": 2,
    "position_id": 1,
    "content": "◆ 조직소개 카카오의 API 플랫폼을 함께 개발할 뛰어난 소프트웨어 개발자를 찾고 있습니다. 카카오 API 플랫폼은 Third-party 및 사내의 다양한 서비스의 기반이 되는 플랫폼이며, 카카오의 유용한 자산을 이용 및 발굴하여, 사용자들에게 새로운 가치를 창출할 수 있는 기회를 제공해주는 플랫폼입니다. 사내의 다양한 서비스, 공동체 서비스를 비롯하여, 카카오와 함께 성장할 수 있는 여러 Third-party와 소통하며 플랫폼 생태계를 함께 구축하고 있으며, 이 즐거운 도전을 함께 하실 분, 열정이 풍부하신 분을 기다리고 있습니다. ◆ 업무내용 ◼︎메인 카카오디벨로퍼스 프론트/서버 개발 ◼︎서브 Kakao Javascript SDK 개발 API플랫폼 어드민 사이트 개발 개발자 포럼 사이트 운영 ◆ 지원자격 개발 경력 3년 이상인 분 React, NextJS, TypeScript 개발 경험이 있으신 분 ◆우대사항 NodeJS 백엔드 개발 경험이 있으신 분 Docker, Kubernetes 등 클라우드 시스템에 이해가 있으신 분 Kafka, MongoDB 활용 경험이 있으신 분"
  },

  {
    "posting_id": 7,
    "company_id": 2,
    "position_id": 2,
    "content": "◆ 조직소개 우리 조직은 카카오톡 사용 맥락 안에서, 사용자들이 필요한 모든 것을 쉽고 재미있게 발견할 수 있는 서비스를 만듭니다. 이를 위해 다양한 형태의 데이터를 검색할 수 있는 검색 서비스와, 이를 뒷받침하는 검색 플랫폼을 함께 개발하고 있습니다. 실제 서비스에 바로 적용 가능한 모델을 중심으로 연구 및 개발을 진행하며, 최상의 사용자 경험을 제공하기 위해 트렌드를 빠르게 파악하고, 필요한 기술과 모델을 직접 개발하고 적용하는 역할을 수행합니다. ◆ 업무내용 데이터 파이프라인 개발, 검색 서비스 Rest API 개발, 검색 컬렉션 설계 및 셋업, 검색 플랫폼 개발. ◆ 지원자격 백엔드 개발 경력 3년 이상인 분, Java 및 Spring 기반 웹 서비스 및 배치 처리 개발 경험이 있는 분, Linux 환경에서의 웹 서비스 및 배치 처리 개발 경험이 있는 분, ElasticSearch 활용 경험이 있는 분, Docker 및 Kubernetes(K8s) 사용 경험이 있는 분. ◆ 우대사항 검색 쿼리 분석 및 결과 Relevancy 개선 프로젝트 경험이 있는 분, Lucene, ElasticSearch에 대한 이해와 개발 경험이 있는 분, Hadoop eco 시스템을 활용한 대용량 데이터 처리 경험이 있는 분, 대용량 트래픽 처리 경험이 있는 분, Kafka, Redis, MongoDB 활용 경험이 있는 분."
  },

  {
    "posting_id": 8,
    "company_id": 2,
    "position_id": 3,
    "content": "◆ 조직소개 지속적으로 성장하고 있는 온라인 커머스/광고 시장에서 상품과 데이터 연동을 통해 브랜드/셀러들의 마케팅 효과를 극대화 하는 한편 카카오에서 제공하는 비즈니스 자산을 활용해 국내에서 가장 많은 사용자들에게 상품을 광고할 수 있는 솔루션을 만들고 있습니다. ◆ 업무내용 상품 기반 광고 지원을 위한 카탈로그 플랫폼 구조 설계 및 기획, 리테일플랫폼 파트너와의 상품 데이터 연동 프로세스 지원, 외부 파트너사를 위한 오픈API 기능 설계 및 플랫폼 기획, 카카오 비즈니스 자산과 상품 카탈로그 자산 연동 및 데이터 플로우 설계, 리테일미디어 광고 플랫폼 확장성 및 성능 고도화를 위한 로드맵 수립. ◆ 지원자격 백엔드 플랫폼 기획 경력 5년 이상, 커머스 / 디지털 광고 도메인에 대한 이해 및 관련 업계 경험, 기술 문서 작성 및 커뮤니케이션 / 협업 능력. ◆ 우대사항 애드테크 관련 프로젝트 경험 및 관련 경력, 상품데이터 연동 및 카탈로그 관리 시스템 구축 경험 및 관련 경력, 오픈API 설계 및 플랫폼 비즈니스 경험."
  },

  {
    "posting_id": 9,
    "company_id": 2,
    "position_id": 4,
    "content": "◆ 조직소개 우리 조직은 AI 서비스의 성공을 위해 필요한 생성형 AI 기술을 End-to-End로 개발하고 있습니다. 전반적인 서비스 지향 LLM(대규모 언어 모델) 연구 및 엔지니어링 업무를 담당하고 있으며, 특정 기술에 한정하지 않고 AI 서비스의 성공과 문제 해결을 위한 솔루션을 탐구하고 적용합니다. ◆ 업무내용 신규 AI 서비스에 필요한 LLM의 End-to-End 개발 범용 및 서비스 벤치마크를 위한 LLM 학습, 평가 작업 및 데모 개발 LLM의 비용 및 속도 최적화에 대한 연구 수행 ◆ 지원자격 Python을 능숙하게 활용하실 수 있는 분 Kubernetes(k8s), Airflow, Kafka, Hadoop, 데이터베이스 등 기본적인 엔지니어링 역량을 보유하신 분 AI 모델링 또는 엔지니어링 경험을 5년 이상 보유하신 분 ◆ 우대사항 시스템 엔지니어링, CUDA, C++ 개발 역량이 우수하신 분 데이터 구축부터 모델 학습, 서빙까지 End-to-End LLM 파이프라인 구축 경험이 있으신 분"
  },

  {
    "posting_id": 10,
    "company_id": 2,
    "position_id": 5,
    "content": "◆ 조직소개 사용자 입장에서 유용한 광고 서비스 경험을 지원하고 동시에 광고주에게는 좋은 광고 성과를 낼 수 있도록, 최적화된 광고 추천 로직과 서빙 시스템을 개발 및 운영하면서 광고 추천 서비스를 제공하고 있습니다. 특히 다양한 서비스 및 광고 관련 데이터에 기반하여 사용자의 관심과 성향에 맞는 광고를 추천하는 알고리즘을 개발합니다. 이와 관련하여 데이터 분석, 모델링 과정에서 심도 깊은 데이터 사이언스(Data Science, 데이터 과학), 머신러닝(Machine Learning, 기계학습) 기술을 적용하고 있습니다. ◆ 업무내용 카카오의 다양한 서비스 및 광고 데이터에 기반하여 유저와 광고 관련 특징 데이터(feature)를 분석하고 발굴하여 성향 추정 프로파일링, 예측 모델링 등 최적화 로직 개발을 통해 실시간 상황에 가장 부합하는 광고를 선별하고 가치를 측정, 광고 추천 서비스를 제공. 대용량 데이터를 다루면서 온라인(실시간) 학습을 통해 최적의 광고 추천 서비스를 제공하기 위해 데이터 사이언스, 머신러닝 관련 고도의 기술을 보유 및 발전. 맞춤 타게팅, 랭킹 및 추천, 효율적 예산 소진, 클릭 및 전환율 예측, 강화 학습 및 탐색 전략 등 다양한 주제에 대해 연구, 개발. ◆ 지원자격 수학/통계, 데이터 사이언스, 머신러닝(기계학습), 딥러닝(Deep Learning)에 관한 지식과 경험이 풍부한 분. 하나 이상의 프로그래밍 언어에 능통한 분 (예, Python, R, Java, Scala, C/C++, Golang 등). 석사학위 + 2년 이상 경력, 혹은 학사학위 + 3년 이상 경력. ◆ 우대사항 통계분석, 인공지능/머신러닝 관련 석/박사학위 또는 이에 준하는 경력을 소지하신 분(컴퓨터공학, 수학, 통계, 산업공학 등). 다양한 분야(언어, 이미지 처리 포함)에 머신러닝 알고리즘 적용 경험이 있는 분. 데이터 파이프라인 구축, ETL 작업 등 데이터 엔지니어링에 경험이 있는 분. 최신 논문을 참조하고 구현해보는 작업에 경험이 있는 분. 여러 기계학습 모델링 도구(예, TensorFlow/Keras, PyTorch, scikit-learn, Spark ML 등)에 익숙하신 분. 데이터 분석 패키지에 익숙한 분(SAS, R, Matlab, Tableau 등). 빅데이터 엔지니어링 도구에 익숙한 분(Hadoop, Hive/SQL, Spark, Druid 등). Kaggle 등 대회 출전 및 입상 경험."
  },

  {
    "posting_id": 11,
    "company_id": 3,
    "position_id": 1,
    "content": "AI Character Studio는 생성형 AI를 바탕으로 한 Product를 개발 및 운영하고 있습니다. 기술로서의 AI뿐만 아니라 사용자에게 새로운 경험과 편의를 제공하는 서비스와, 이를 통해 의미 있는 성과를 만드는 데 집중합니다. 구체적으로는 다음과 같은 업무를 진행하고 있습니다: 대화형, 이미지/비디오, 보이스 등 딥러닝 기술을 활용하여 B2C 및 B2B 분야에서 차세대 커뮤니케이션 솔루션 개발, B2C: 딥러닝을 활용한 AI 컴패니언 서비스 개발, B2B: 브랜드와 사용자 간의 연결을 강화하는 딥러닝 플랫폼 개발. 저희 팀은 사업, 기획, 디자인, 개발 등 각 분야의 전문가들이 모인 목적 조직으로, 사용자의 요구를 이해하는 것부터 서비스 개발까지 속도감 있게 진행하고 있습니다. 빠른 의사 결정과 실행을 통해 가파른 성장과 뚜렷한 성과를 만들고 싶은 분들을 환영합니다. 담당업무 생성형 AI 기반 서비스의 웹 개발 및 운영, 프론트엔드 개발 환경 개선 및 품질 개선을 위한 지속적인 노력. 자격요건 5년 이상의 프론트엔드 개발/운영 경험 혹은 이에 준하는 역량이 있으신 분, JavaScript, TypeScript, HTML, CSS를 다루며 내부 동작 원리에 대한 관심이 있으신 분, React, Vue 등 SPA 프레임워크 이해와 경험이 있으신 분, Next.js, Nuxt.js 등 서버 사이드 렌더링(SSR) 이해와 경험이 있으신 분, 논리적 사고력과 추론 능력 그리고 실제 코드 구현 능력을 갖추신 분, 새로운 기술 습득에 적극적이신 분, 해외 출장 및 근무에 결격 사유 없으신 분. 우대사항 GraphQL 경험이 있으신 분, JavaScript 오픈 소스에 기여 경험이 있으신 분, 이미지 최적화, 리소스 압축, 캐싱 전략 등 프론트엔드 자원 최적화 경험이 있으신 분, 반응형/적응형 웹 및 웹앱 개발 경험이 있으신 분, GitHub Actions 등을 이용한 CI/CD 구축 경험이 있으신 분, Dockerize를 통한 k8s 환경에서의 서비스 운영 경험이 있으신 분, 적극적인 리더십과 강한 문제 해결 능력을 보유하신 분."
  },

  {
    "posting_id": 12,
    "company_id": 3,
    "position_id": 2,
    "content": "담당업무 LINE의 수 많은 서비스들에 대한 대규모 수준의 Observability를 제공하기 위한 사내에서 자체 개발된 시스템의 개발 및 운영, Metrics/Events/Logs/Traces 등의 수집 pipeline 개발 및 운영, 대용량 Metric 데이터를 관리하기 위해 자체 개발한 Time Series Database 개발 및 운영, 대용량 데이터를 저장 및 관리하기 위한 다양한 오픈소스 기술들의 사용 및 운영. 자격요건 Linux를 이용한 실무 및 개발 경험 5년 이상을 보유하신 분, 컴퓨터공학 기본 지식을 이해하고 능숙하게 활용하실 수 있으신 분, 다양한 언어나 기술 등을 익히고 사용하는 것에 거부감이 없는 분, 유연한 생각을 바탕으로 다양한 문제해결을 즐기시는 분, 해외 출장 및 근무에 결격사유 없으신 분. 우대사항 분산 시스템이나 어플리케이션 성능 개선 등에 경험이나 관심이 많으신 분, 대규모 트래픽 처리 경험이 있으신 분, Java, Kotlin, Go, Rust 중 하나 이상 언어에 능숙하신 분, 동료들에게 도움이 되는 것에 대한 개발에 흥미가 있으신 분, 트러블슈팅에 흥미가 있고 성취감을 느끼시는 분, Prometheus, Grafana, OpenTelemetry, OpenTSDB, Datadog, New Relic, Dynatrace, Splunk 등의 기술이나 사용 경험이 있으신 분, Kubernetes, Kafka, Elasticsearch, Cassandra 등의 기술들에 관심이 많으신 분, 외국어(영어 또는 일본어)로 업무 진행이 가능하신 분."
  },

  {
    "posting_id": 13,
    "company_id": 3,
    "position_id": 3,
    "content": "LINE의 수억 사용자들이 매일 마주하는 LINE Home Tab의 방향성과 성장을 이끌 Senior Product Manager를 찾습니다. Home Tab 사용자 경험을 혁신하고 비즈니스 가치를 높이는 전략을 수립하며, 다양한 팀과 협업해 실질적인 임팩트를 만들어갈 분을 기다립니다. 이 역할은 Home tab 소비를 활성화하는 핵심 서비스를 기획하고, 전략 수립부터 실행, 지표 개선까지 전 과정에 깊이 관여해 서비스 성장을 주도합니다. 담당업무 LINE Home Tab 내 신규 기획 및 기능 개선을 위한 전략 수립, 사용자 관점에서 문제를 정의하고, 구체적인 로드맵으로 전환, 사용자 경험 및 데이터 분석을 기반으로 한 서비스 고도화 및 KPI 개선, 디자인, 개발, 사업, 운영, 데이터, PMO 등 다양한 부서와 긴밀히 협업하여 프로젝트를 효과적으로 조정 및 추진, 콘텐츠 소비 흐름 및 플랫폼 성장 트렌드에 기반한 UX 개선. 자격요건 6년 이상의 서비스 기획 또는 제품 관리(Product Management) 업무 경험을 보유하신 분, 스스로 목표와 전략 설정이 가능하고, 논리적이고 효과적인 커뮤니케이션 능력을 보유하신 분, 프러덕트에 대한 오너십을 가지고 서비스를 론칭하고 주도적으로 크게 성장시켜본 경험을 보유하신 분, 데이터를 기반으로 문제 해결 능력을 보유하신 분, 실패를 두려워하지 않고 근성을 가지고 배움과 일을 대하시는 분, 해외 출장 및 근무에 결격 사유 없는 분. 우대사항 콘텐츠 서비스의 Product Management 경험이 있으신 분, 콘텐츠 수급부터 사용자 전달까지, 전 과정을 경험해 보신 분, 다양한 조직 또는 서비스 간의 협업을 주도하고, 연결하여 통합 서비스를 만들어본 경험이 있으신 분, 추천 및 데이터 분석에 대한 경험과 높은 이해를 보유하신 분, Hybrid Work(원격 및 대면 혼합) 환경에서도 자율적으로 업무를 추진할 수 있는 분, 일본을 포함한 다양한 문화적 배경의 팀이나 파트너와 협업 경험을 보유하신 분."
  },

  {
    "posting_id": 14,
    "company_id": 3,
    "position_id": 4,
    "content": "조직소개 LINE Plus는 전 세계 수억 명이 사용하는 메신저와 다양한 생활밀착형 서비스를 기반으로 세계 각국 사용자와 함께 성장하고 있는 글로벌 테크 기업입니다. 우리는 메신저, 검색, 미디어, 커머스, AI와 같이 사용자의 삶과 밀접하게 연결되어 일상을 책임지는 life platform을 만들어 갑니다. 사용자의 질문에 응답하는 단순한 챗봇을 넘어, 고객의 요청을 실시간으로 이해하고 판단하며, 내부 시스템과 연동해 실행 가능한 지능형 Agent를 설계하고 확장해 나가고자 합니다. 포지션 소개 AI Agent가 실제 사용자 요청을 이해하고 실행할 수 있도록, [대화 이해 – 응답 생성 – 시스템 트리거]까지 연결하는 전체 구조를 설계하고 구현하는 역할을 맡습니다. Front-end, Back-end, Machine Engineering 등 다양한 영역을 아우르며 기술 실험에만 그치지 않고, 기획부터 설계, 실제 서비스 구현과 고도화까지, 플랫폼 수준의 Agent 기술을 함께 완성해 나갈 엔지니어를 기다립니다. 담당업무 AI Agent Platform의 신규 및 기존 서비스(대화형 AI, 분석 도구 등) 설계·개발·운영, 사용자와 AI가 상호작용하는 Web 또는 App 기반 인터페이스 개발 (Front-end), AI, 백엔드 시스템, 외부 서비스와의 연동 및 대규모 데이터 처리를 위한 서버/API 개발 (Back-end), 대화 데이터, 로그, 고객 상호작용 데이터 등 다양한 데이터 파이프라인 설계 및 품질 관리 (Data Engineering), 자연어처리, 음성인식, 감성분석 등 AI 모델 개발·학습·배포, 모델 성능 모니터링 및 개선 (ML Engineering), 실시간 데이터 처리 및 대시보드, 시각화 등 데이터 기반 분석 기능 구현, 제품 품질 및 서비스 안정성 확보를 위한 테스트 자동화, 모니터링, 품질 개선 주도, DevOps, CI/CD, 클라우드(AWS, GCP 등) 기반 자동화·배포·운영, 제품 기획, 디자인, QA, 데이터 과학자 등 다양한 직군과의 원활한 커뮤니케이션 및 협업. 자격요건 컴퓨터공학/전자공학/인공지능 등 관련 전공 학사 이상 혹은 동등한 경험이 있으신 분, 3년 이상의 소프트웨어 엔지니어링 경력이 있으신 분 (Front-end, Back-end, Data, ML 중 1개 이상), Python, Java, JavaScript(React 등), SQL 등 하나 이상의 언어와 프레임워크 활용이 가능하신 분, RESTful API 및 데이터베이스 설계/운영 경험이 있으신 분, 클라우드 환경(AWS, GCP, Azure 등) 기반 서비스 개발/배포 경험이 있으신 분, 데이터 및 시스템 설계, 문제해결, 프로그램 최적화 능력을 보유하신 분, 다양한 직무와 명확하게 소통할 수 있는 커뮤니케이션 능력을 보유하신 분, 방향 제시 없이도 스스로 동기를 부여하며, 문제를 정의하고 도전을 즐기는 분, 작고 집중된 팀에서 ‘하고 싶은 일’을 찾아 주체적으로 실행해 온 경험이 있는 분, 해외 출장 및 근무에 결격 사유 없으신 분. 우대사항 대화형 AI, 음성인식, NLP 등 AI/ML 관련 솔루션 실무 경험이 있으신 분, 대규모 데이터 처리, 실시간 데이터 스트리밍/분석 경험 (Spark, Kafka 등)이 있으신 분, 데이터 파이프라인, ETL 시스템, MLOps 및 DevOps 환경에 대한 이해도가 있으신 분, React, Vue 등 최신 프론트엔드 프레임워크 및 유형 컴포넌트 UI 설계 경험이 있으신 분, Docker, Kubernetes 등 컨테이너/배포 자동화 환경 경험이 있으신 분, 스타트업 또는 소규모 팀에서 빠르게 “설계–개발–런칭” 프로세스를 경험해 보신 분, 영어 또는 다국어 협업 환경 경험."
  },

  {
    "posting_id": 15,
    "company_id": 3,
    "position_id": 5,
    "content": "ADS Tech 조직 소개 일본, 태국, 대만 등 전 세계 1억 8천만 명 이상의 LINE 사용자를 대상으로 하는 글로벌 광고 플랫폼을 개발합니다. 대량으로 생성되는 데이터들을 실시간으로 처리하고, 사용자들이 관심 있는 광고를 예측하여 제공하며, 복잡한 글로벌 비즈니스 도메인 문제들을 해결합니다. 연간 수천억 원의 LINE의 주요 매출을 담당하고 있고, 매년 빠른 성장을 하고 있습니다. 글로벌 환경에서 기술로 비즈니스 가치를 만드는 데 관심이 있고, 가파르게 수익을 만들어 나가는 과정을 경험하고 싶은 분들을 환영합니다. 포지션 소개 LINE과 Yahoo! JAPAN 서비스를 이용하는 글로벌 사용자들에게 광고를 통해 유익한 경험을 제공하기 위해 최고의 시스템을 개발하고 있습니다. 저희 팀은 광고 시스템의 데이터 파이프라인과 데이터 플랫폼 개발을 담당합니다. 단순한 데이터 처리를 넘어, 비즈니스와 머신러닝 등에서 발생하는 문제를 데이터 관점에서 해결합니다. 담당업무 광고 시스템 내 머신러닝 데이터 분석 및 기반 플랫폼 제공, 데이터 활용을 극대화하여 머신러닝 시스템 고도화 및 ML 문제 해결, 데이터 모델 설계 및 Scientist 및 Planner 들과 협력을 통해 데이터 활용 관점에서 더 나은 방향 제시. 자격요건 3년 이상의 개발 경력을 보유하신 분, Java, Scala 등 한 가지 이상의 JVM 계열 언어 또는 C++에 능숙하신 분, 빅데이터 처리 기술에 대한 기본적인 이해가 있으신 분, 대용량 분산시스템 구축 및 운영 경험이 있으신 분, 새로운 기술을 학습하는데 거부감이 없고, 적극적이고 주도적으로 업무를 수행하시는 분, 해외 출장 및 근무에 결격 사유가 없으신 분. 우대사항 광고 도메인 업무 경험이 있으신 분, Product 수준의 머신러닝 시스템 또는 머신러닝을 위한 데이터 엔지니어링 경험이 있으신 분, 도메인 요구사항을 기반으로 대용량 데이터 분석 환경을 구축해 보신 분, OLAP(ClickHouse, Druid, StarRocks) 데이터베이스 구축 및 운영 경험이 있으신 분."
  },

  {
    "posting_id": 16,
    "company_id": 4,
    "position_id": 1,
    "content": "조직 소개 본 직무는 Coupang Ads 조직의 프론트엔드(프런트엔드) 개발자로서 쿠팡 광고 플랫폼의 새로운 기능을 개발 및 설계하는 역할을 수행하게 됩니다. 쿠팡은 세계 최고 수준의 광고 비즈니스를 구축하기 위한 투자를 하고 있으며, 쿠팡 웹사이트 및 모바일 앱 상에 위치한 주요 구좌에 연관성 있는 광고를 운영하고 있습니다. Coupang Ads 조직은 쿠팡의 판매자 및 공급자에게 셀프서비스 광고 운영 기능을 제공함으로써 쿠팡의 광고 솔루션을 보다 성장시키기 위한 차세대 프로덕트 및 서비스를 개발 중에 있습니다. Coupang Ads 조직은 쿠팡의 광고 상품을 구현할 수 있는 시스템과 인프라를 개발할 열정적인 소프트웨어 개발자를 찾고 있습니다. 본 직무에는 그린필드 프로젝트 개발과 낮은 레이턴시 및 고가용성(availability) 서비스, 확장가능한 시스템, 프로그래매틱 연동을 위한 API 개발이 포함됩니다. 또한, 풀기 어려운 문제를 파악 및 해결하여 시스템의 확장성(scalability)과 신뢰성(reliability)을 향상시키는 작업과 효율적인 리소스 운영도 요구됩니다. 낮은 레이턴시와 높은 확장성을 갖춘 분산 서비스 개발에 관심이 있으신 분, 세계 최고 수준의 쿠팡 광고 비즈니스 구축이라는 큰 기회의 일원이 되고 싶으신 분, 쿠팡미디어그룹은 이러한 서비스를 함께 개발할 리더를 찾고 있습니다. 업무 내용 비즈니스가 원하는 결과물을 기술적 솔루션으로 해석해 운영 및 비즈니스의 니즈를 충족, 애플리케이션 시스템의 코딩, 테스트, 디버깅을 수행하며 소스 코드 제어 시스템 및 애플리케이션 소프트웨어 버저닝을 유지보수, 조직에 솔루션 제공 및 플랫폼 전반의 가치제안 및 효율 개선, 새로운 기술, 테크닉 및 업계 최신 동향을 조사 및 파악하며, 조직에 솔루션 제공 및 플랫폼 전반의 가치제안 및 효율 개선, 개발, 개선 및 테스트 프로젝트의 요구사항 및 프로세스, 절차 정의, 기획자, 데이터 분석가, UX 디자이너와 협업하여 신규 서비스 개발, 타 엔지니어의 교육 및 멘토링할 수 있는 지식 및 능력 보유. 자격 요건 Computer Science/Engineering 관련 전공분야의 BA/BS 학위가 있는 분, 장애 허용 및 모니터링 기능이 있는 프론트 엔드, 대규모 운영시스템 개발 및 설계 경험이 5년 이상인 분, WebKit, HTML5, CSS3, Javascript(한 개 이상의 node.js, react.js, 또는 express.js, Next.js), Typescript에 능숙한 분, RESTful, GraphQL 및 마이크로 서비스 아키텍처 설계 및 개발에 대한 전문 지식이 있는 분, React 등 JS 프레임워크를 이용하여 사용자 서비스 개발 경험이 있는 분, Babel, Webpack, NPM 등 일반적인 프론트 엔드 개발 도구 사용 경험이 있는 분, 사용성, Lean UX 설계, 개념적 모델링, 트렌드에 대한 뛰어난 지식이 있는 분, 비지니스 요구 사항을 명확하게 이해하고 이를 구현하는 능력이 있는 분, 단위/사용자 테스트 및 반복설계/인터랙션 설계 경험이 있는 분. 우대 사항 광고 및 이커머스 도메인 경험이 있는 분, 데이터베이스 시스템, 데이터 웨어하우징 개념에 대한 높은 이해가 있는 분, 확장성이 매우 높은 클라우드 기반 소프트웨어 및 배포 경험이 있는 분, 웹서비스/API 설계 능숙한 분, 애자일 소프트웨어 개발 경험이 있는 분, 마이크로 서비스 아키텍쳐 경험이 있는 분, 아마존 웹 서비스, 분산 시스템, 서비스 기반/메시지 기반 아키텍쳐 경험이 있는 분, SQL, NoSQL, Kafka, Redis, Hive, Hadoop, Spark, WebKit, HTML5, CSS3, Javascript, Node.js, React.js, Express.js, Vue."
  },

  {
    "posting_id": 17,
    "company_id": 4,
    "position_id": 2,
    "content": "조직 소개 본 직무는 Coupang Ads 조직의 백엔드 개발자로서 쿠팡 광고 플랫폼의 새로운 기능을 개발 및 설계하는 역할을 수행하게 됩니다. 쿠팡은 세계 최고 수준의 광고 비즈니스를 구축하기 위한 투자를 하고 있으며, 쿠팡 웹사이트 및 모바일 앱 상에 위치한 주요 구좌에 연관성 있는 광고를 운영하고 있습니다. Coupang Ads 조직은 쿠팡의 판매자 및 공급자에게 셀프서비스 광고 운영 기능을 제공함으로써 쿠팡의 광고 솔루션을 보다 성장시키기 위한 차세대 프로덕트 및 서비스를 개발 중에 있습니다. Coupang Ads 조직은 쿠팡의 광고 상품을 구현할 수 있는 시스템과 인프라를 개발할 열정적인 소프트웨어 개발자를 찾고 있습니다. 본 직무에는 그린필드 프로젝트 개발과 낮은 레이턴시 및 고가용성(availability) 서비스, 확장가능한 시스템, 프로그래매틱 연동을 위한 API 개발이 포함됩니다. 또한, 풀기 어려운 문제를 파악 및 해결하여 시스템의 확장성(scalability)과 신뢰성(reliability)을 향상시키는 작업과 효율적인 리소스 운영도 요구됩니다. 낮은 레이턴시와 높은 확장성을 갖춘 분산 서비스 개발에 관심이 있으신 분, 세계 최고 수준의 쿠팡 광고 비즈니스 구축이라는 큰 기회의 일원이 되고 싶으신 분, Coupang Ads 조직은 이러한 서비스를 함께 개발할 리더를 찾고 있습니다. 업무 내용 비즈니스가 원하는 결과물을 기술적 솔루션으로 해석하고 구현하여 비즈니스의 니즈를 충족, 광고주향 캠페인 관리와 리포팅을 위한 확장가능하고 고성능의 마이크로 서비스 기반의 백엔드 서비스 개발 설계, 개발 및 운영, 프론트엔드 개발자, 제품 관리자, 데이터 분석가, UX 디자이너를 포함한 cross-functional 팀과 긴밀하게 협업하여 원활하고 효율적인 솔루션을 제공함, 광고 플랫폼의 다양한 구성 요소와의 원활한 통합을 위해 강력하고 안전한 API를 구현, 복잡한 문제를 간단하고 간단한 솔루션으로 분해하고 효율적으로 커뮤니케이션하여, 팀이 우선순위에 따라서 빠르게 움직일 수 있는 기술적인 해결책 도출, 중요한 시스템 문제를 깊이 파고들어 유사한 근본 원인을 선제적으로 해결하고 운영 우수성의 기준을 제고, 새로운 기술, 테크닉 및 업계 최신 동향을 조사 및 파악하며, 조직에 솔루션 제공 및 플랫폼 전반의 가치제안 및 효율 개선, 개발, 개선 및 테스트 프로젝트의 요구사항 및 프로세스, 절차 정의, 코드 리뷰를 수행하고 팀의 주니어 멤버를 멘토링. 자격 요건 Computer Science/Engineering 관련 전공분야의 BA/BS 학위가 있는 분, 알고리즘, 데이터 구조 및 설계 패턴에 대한 깊은 이해를 바탕으로 한 소프트웨어 개발 경력 5년 이상인 분, 웹 기반 소프트웨어 아키텍쳐, 분산 시스템 및 메시지 기반 아키텍쳐에 대한 깊은 이해가 있는 분, RESTful, GraphQL, GRPC API 및 마이크로서비스 아키텍처 설계 및 개발에 대한 전문 지식이 있는 분, 데이터베이스 시스템, 데이터 웨어하우징 개념 및 언어(SQL, NoSQL)의 경험이 있는 분, 장애 허용 및 모니터링 기능이 있는 대규모 운영 시스템 경험이 있는 분, 뛰어난 문제 해결 및 디버깅 기술을 보유한 분, 효과적인 의사소통 능력과 팀에서 협업할 수 있는 능력이 있는 분. 우대 사항 광고 및 이커머스 도메인 경험이 있는 분, 적정 규모의 빅데이터 그리고/또는 머신러닝 경험이 있는 분, AWS, Azure 또는 Google Cloud와 같은 클라우드 플랫폼 경험이 있는 분, 컨테이너화 및 오케스트레이션 도구(예: Docker, Kubernetes)에 대한 경험이 있는 분, 소프트웨어 개발팀 리더 경력이 있는 분, 애자일 소프트웨어 개발 경험이 있는 분, Spring, Java, Kotlin, Node.js, Kafka, Redis, Hive, Hadoop, Spark, ElasticSearch에 대한 경험이 있는 분."
  },

  {
    "posting_id": 18,
    "company_id": 4,
    "position_id": 3,
    "content": "직무 소개 Retail Ops PM은 로켓배송 운영의 효율성 개선과 생산성 극대화를 목표로 하고 있습니다. 이를 위해 로켓배송 운영 전반적인 프로세스 혁신과 시스템 자동화를 주도하는 역할을 수행합니다. 로켓배송 운영 흐름에 대한 깊은 이해를 바탕으로 단기/중기/장기적인 관점에서 지속 가능한 개선 방안을 설계하고 실행합니다. 이를 통해 운영 시스템의 기능을 고도화하고 있습니다. 또한, 현장에서 발생하는 다양한 운영 이슈에 대해 신속하고 정확하게 대응하며, 체계적인 Root Cause 분석을 통해 반복되는 문제의 근본 원인을 규명하고, 재발 방지를 위한 지속 가능한 솔루션을 도출합니다. 업무 내용 시스템 프로젝트 기획/운영 및 시스템 이슈 대응, 프로세스 프로젝트를 통해 찾은 개선 사항을 시스템화하여 로켓배송 운영 생산성을 극대화, 시스템 요구사항을 정리하며 데이터 기반으로 퍼포먼스를 측정하여 Tech 조직 협업을 진행, 플랫폼 런칭 및 개선에 대한 테스트를 지원하며 프로젝트 퍼포먼스를 측정하여 프로젝트를 완료, 로켓배송 운영 플랫폼에 대한 시스템 이슈(에러)에 대해서 대응. 프로세스 프로젝트 기획/운영, 다양한 이해관계자로부터 로켓배송 운영 프로세스에 대한 Pain-Point를 확인하고 요구사항을 수집, 수집된 내용을 데이터 기반으로 검증하고, 프로젝트를 기획/런칭, 프로젝트가 적시 완료되도록 리딩하고, 프로젝트 퍼포먼스를 측정하여 프로젝트를 완료. AI 프로젝트 기획/운영, 조직 내 업무 프로세스를 분석하여 AI 전환이 가능한 영역을 식별하고 자동화 전략을 수립, AI 프로젝트를 기획하고 테스트를 통한 모델 성능 검증 및 개선을 진행하여 고도화, 최신 기술 트렌드를 조사하여 모델의 정확도와 효율성을 지속적으로 향상. 자격 요건 총 경력 7년 이상, 프로젝트 매니지먼트 경력 3년 이상 있으신 분, 운영 프로세스에 대한 빠른 이해력을 바탕으로 문제를 구조화하고 해결할 수 있는 역량을 보유하신 분, 데이터 기반의 분석 역량을 바탕으로 가설을 수립하고, 이를 통해 실행 가능한 개선안을 도출하실 수 있는 분, 내·외부 이해관계자와의 원활한 커뮤니케이션을 통해 솔루션을 도출하고, 이를 설득력 있게 전달한 경험이 있으신 분, 복수의 과제를 효과적으로 우선순위화하고, 프로젝트를 안정적으로 리딩한 경험이 있으신 분. 우대 사항 리테일 및 이커머스 분야에서 프로젝트 기획 및 운영 경험이 풍부하신 분, 데이터 분석 툴 활용 가능하신 분 (Excel, SQL, Python, Tableau), 문서 작성 능력 뛰어나신 분, 비즈니스 영어 가능하신 분, 높은 책임감과 진정성을 바탕으로, 조직에 실질적인 임팩트를 만들어내는 데 열정을 가지신 분."
  },

  {
    "posting_id": 19,
    "company_id": 4,
    "position_id": 4,
    "content": "역할 요약 Detection Engineering(DE) 팀은 전사적인 위협 탐지를 위한 보안 데이터 파이프라인과 자동화 인프라를 구축 및 운영하는 역할을 담당합니다. 우리의 미션은 AI/ML 기술을 보안 스택에 통합하여 확장 가능하고 지능적인 위협 탐지를 가능하게 하는 것입니다. Blue Team 운영, SOC 분석가, 위협 헌터들과 긴밀하게 협력하여 탐지, 분류, 대응 프로세스를 자동화합니다. Senior Principal Cybersecurity AI Engineer는 기술 방향을 주도하고, 다른 기술 리더 및 이해관계자들과 정렬을 이끌어내며, 팀과 신뢰를 쌓고, 확장성, 미래 확장성, 안정성을 고려한 복잡한 시스템을 성공적으로 설계·전달할 수 있는 경험 많고 열정적인 엔지니어링 리더입니다. 주요 업무 책임 보안 도메인 전문성과 AI/LLM 기능을 연결하는 PoC 프로젝트 설계, LLM 기반 보안 유즈케이스 개발: 내부자 위협 평가 / 민감 정보 유출 방지 / 보안 위협 탐지, LLM 에이전트를 활용한 SOC 티켓 요약 및 분류 등 자율 보안 분석을 위한 에이전트-투-에이전트 프레임워크 설계 및 구현, 멀티 에이전트 협업 내 작업 분해 및 조정 워크플로우 설계(예: MCP 프레임워크), SOC 티켓 또는 탐지 로그를 요약·분류하는 LLM 기반 시스템 구축, 프로덕션 사용을 위한 Python 기반 분석 파이프라인 및 ML 추론 서비스 자동화, 타 팀들과의 협업을 통한 도메인 전문성 제공 및 LLM/ML 활용 가능성이 있는 업무 영역 발굴. 기본 자격 LLM 기반 프로젝트 실무 경험 1년 이상(프로덕션 서비스 구축 및 배포 포함), 머신러닝 실무 경험 3년 이상, Bedrock, Hugging Face, LangChain, LlamaIndex 등 생성형 AI 프레임워크 경험, 보안 로그 및 티켓 데이터와 같은 텍스트 기반 로그에 대한 이해, Python 기반 LLM 또는 AI/ML 프로젝트 경험. 우대 사항 멀티 에이전트 시스템 설계 또는 구현 경험(MCP, 에이전트-투-에이전트 프레임워크 등), 보안 운영(SOC, 사고 대응) 경험 또는 보안 로그 구조에 대한 이해, MLOps 또는 추론 서빙 인프라 구축 경험, 대규모 로그 데이터를 활용한 이상 탐지 모델 개발 또는 평가 경험."
  },

  {
    "posting_id": 20,
    "company_id": 4,
    "position_id": 5,
    "content": "팀 소개 이 역할은 Coupang의 SCM Autonomation 팀의 일원으로서 빠르게 성장하는 대만 이커머스 비즈니스를 지원하게 됩니다. SCM Autonomation 팀은 고객에게 세계적 수준의 솔루션을 제공하기 위해 제품 개발, 고급 데이터 사이언스 역량 구축, 분석 프레임워크 설계 및 프로세스 전반을 소유하는 역할을 담당합니다. 이 팀이 보유한 핵심 솔루션 중 하나는 최첨단 머신러닝/딥러닝(ML/DL) 모델과 시스템 역량을 갖춘 견고한 수요 예측 플랫폼입니다. 수요 예측은 소매업체에게 있어 성장을 좌우하고 조직의 건전성에 영향을 미치는 핵심 요소입니다. 컴퓨팅 제약이 사라진 상황에서, ML/DL 기반 예측 모델은 고객에게 적시에 적절한 비용으로 SKU(재고관리단위)를 제공하는 데 큰 영향을 미칩니다. 이 역할은 프로모션, 계절성, 주기성, 장기 예측 등 복잡한 비즈니스 과제를 해결하기 위한 최첨단 ML/DL 예측 모델을 구축하는 업무를 포함합니다. 해당 인력은 데이터 사이언스 모델의 세부적인 특성을 깊이 이해하고, ML/DL 모델 설계에 대한 완전한 가시성과 통제력을 확보하며, 모델 설계 시의 트레이드오프를 명확히 하고, 이해관계자들과의 협업을 통해 올바른 우선순위 결정을 이끌어내야 합니다. 또한, 이 역할은 예측 외에도 분류, 회귀, 군집화 등 다양한 데이터 사이언스 과제를 해결하는 데에도 기여할 것으로 기대됩니다. 업무 내용 머신러닝 모델 정의 및 수요 예측 모델 로드맵 수립: 신선식품(Fresh) 및 일반상품(Core) 등 다양한 비즈니스 라인을 포괄하는 예측 모델 전략 수립, 피처 엔지니어링: 수평적 공통 요구사항과 수직적 도메인 특성을 모두 반영하는 자동화 및 비즈니스 맥락 기반의 모델 피처 설계, 데이터 전처리 알고리즘 설계 및 구현, 실험 설계, 모델 아키텍처, 검증/평가 기법을 포함한 ML/DL 모델 개발, 제품, 비즈니스, 재무, 분석 팀과 협업하여 기능 우선순위 결정, ML 모델 설계에 대한 명확한 구조와 설명 제공, 모델 작동에 대한 심층 분석을 통해 근본적인 결함 제거, 모델 입력 데이터의 품질, 가시성, 투명성 향상, 예측 모델 입력값을 지속적으로 모니터링하고 검증하는 프로세스 및 기술 솔루션 구축을 통해 모델 정확도와 적합성 유지, “Garbage In, Garbage Out”을 방지하기 위한 철저한 입력 데이터 관리. 자격 요건 최소 석사 학위 이상 보유, 데이터 사이언스 및 모델링 분야에서 8~12년 이상의 경력, 뛰어난 분석적 사고 능력 및 Excel/SQL 숙련도, 데이터 사이언스 경험: 실험 설계 및 ML/DL 모델을 처음부터 구축한 경험, 우수한 데이터 분석 및 모델링 역량, Python 또는 R 사용 능력, 제품 문서화(PRD), 시각화 및 시뮬레이션 역량: 의사결정을 효과적으로 지원하는 문서 및 자료 작성 능력, 우선순위 설정 및 멀티태스킹 능력: 여러 프로젝트를 동시에 수행하면서 핵심 과제를 명확히 식별하고 추진하는 능력."
  },

  {
    "posting_id": 21,
    "company_id": 5,
    "position_id": 1,
    "content": "[주요업무] 배달의민족 결제서비스의 웹, 웹앱, 백오피스를 개발합니다. Javascript web application framework, library 개발 및 운영합니다. [자격요건] 3년 이상의 웹 프론트엔드 개발 경험이 있으신 분. HTML(5), CSS, Javascript(최소 ES5), React 기본 지식을 보유한 분. AWS, Git & Github, HTTP, RESTful API 클라이언트 개발 경험이 있으신 분. Javascript MV* Framework 기반 웹앱 개발 및 운영 경험이 있으신 분. Redux, Redux-Saga, RxJS 등 개발 및 운영 경험이 있으신 분. 기획/디자인/운영 등 다양한 직군과 같이 문제를 정의하고 해결책을 찾아나가는 협업 능력을 갖추신 분. [우대사항] TypeScript 개발 및 운영 경험이 있으신 분. 페어 코딩 및 코드 리뷰 경험이 있으신 분. 단위 테스트, 통합 테스트 자동화 및 배포 자동화 경험이 있으신 분. 웹사이트 성능 측정 및 최적화 경험이 있으신 분. 웹사이트 보안에 대한 이해가 있으신 분. Javascript 관련 오픈 소스 기여 경험이 있으신 분. 백엔드 서비스 개발 경험 및 Database에 대한 이해를 갖추신 분 (RDBMS, No-SQL)."
  },

  {
    "posting_id": 22,
    "company_id": 5,
    "position_id": 2,
    "content": "[업무내용] 주문 이후부터 배달이 완료되기까지의 프로세스를 기획자, 디자이너, QA분들과 함께 만들고 있습니다. 운영 효율, 사용성 향상을 위하여 다양한 요구사항을 분석하고 문제를 해결합니다. 배달특성에 따른 최적의 배차와 배달프로세스 과정을 관리하는 배차 & 배달플랫폼 개발, 실시간 배달상황을 모니터링하고 배달인프라 운영을 관리하는 관제플랫폼 개발, 라이더향 앱 서비스 배민커넥트 개발, 라이더 계정, 정산, 성과, 프로모션 등을 관리하는 라이더플랫폼 개발. [지원자격] 실무 개발 경력 5년 이상 또는 그에 준하는 역량 보유자, 문제에 대한 다양한 접근법과 해법을 활용할 수 있는 백엔드 개발자, 다음 기술에 익숙한 분: Java 8 이상, Spring Framework, Spring boot, Spring Cloud, JPA, 기타 Java EE 기술, jUnit과 테스트코드 작성, Git, Jira, Wiki 등의 협업 도구. [우대사항] 대용량 실시간 애플리케이션/시스템 아키텍처 지식과 경험이 있는 분, 서비스 운영과 다양한 상황의 문제를 해결한 경험이 있는 분, Big Data 기반 애플리케이션 개발, ML 경험이나 관심이 있는 분, Cloud Native Application 개발 경험이나 관심이 있는 분, 꾸준하게 코드를 리팩터링 하고 테스트 코드를 작성하는 분, 공개 클라우드 서비스(AWS)를 활용한 개발 및 운영 경험이 있는 분, 빌드/테스트/배포 자동화를 통한 CI/CD 경험이 있는 분, Java 외 플랫폼에도 익숙한 분. [개발환경] 주요 기술: Java, Spring framework, JPA, Apache Kafka, Redis. 업무 도구: Gitlab, Slack, Jira, Confluence, Grafana, IntelliJ IDEA. 협업: Gitlab 기반 온라인 코드리뷰, 페어 프로그래밍."
  },

  {
    "posting_id": 23,
    "company_id": 5,
    "position_id": 3,
    "content": "[조직소개] 우아한형제들 프로덕트전략팀은 PM들과 협력하여 고객 중심의 배민앱을 같이 만들고, 전사의 주요 목표를 달성하기 위한 서비스 방향성과 실행 계획을 수립합니다. 이를 통해 프로덕트 조직이 명확한 방향에 맞춰 변화하고, 목표 달성을 위해 리소스를 효과적으로 집중할 수 있도록 돕습니다. 또한, 효율적이고 실행력 있는 업무를 위한 가이드와 지원을 제공합니다. [업무내용] 배민 푸드/커머스 프로덕트의 로드맵/전략 방향을 수립하고, 고객 경험을 위한 인사이트를 발굴/개선방안을 제안합니다. 내외부 우선순위/의사결정과 프로덕트 방향의 협의를 도우며, 제안 과제가 완성도 높게 진행될 수 있도록 지원합니다. 프로덕트 조직간 시너지를 내고, 효율적인 방식으로 배민의 프로덕트가 개선될 수 있도록 프로덕트의 단/장기 방향성과 기준점을 제시합니다. 사업과 사용자, 업주, 라이더의 다양한 관점을 고려하여, 프로덕트의 우선순위와 중요성을 고민하고 프로덕트 조직에게 우선순위를 제안합니다. Delivery Hero의 다양한 프로덕트 조직과 서로 좋은 사례와 노하우를 공유하고, 인사이트를 정리하여 배민 프로덕트 성장에 기여합니다. [지원자격] 서비스 기획(PM) 및 프로덕트 전략 수립 업무 5년 이상 경험을 보유한 분, 도메인의 고객경험 분석 및 문제를 정의하고, 타사 벤치마크/리서치/데이터분석을 통해 고객경험을 개선할 방안을 정리할 수 있는 분, C레벨 커뮤니케이션 경험 및 다양한 실행부서와의 협업을 통해 효율적으로 프로젝트를 추진한 경험을 보유하신 분. [우대요건] 비즈니스 영어 커뮤니케이션이 가능한 분(미팅, 번역 등), 대규모 프로젝트 또는 다수의 이해관계자가 연관된 프로젝트를 성공적으로 리드한 경험이 있는 분, 배달 서비스, 이커머스, 또는 플랫폼 비즈니스 관련 경험이 있는 분"
  },

  {
    "posting_id": 24,
    "company_id": 5,
    "position_id": 4,
    "content": "[조직소개] 우아한형제들 데이터서비스실은 데이터 기반 의사결정 지원을 위해 다양한 데이터 및 AI 프로덕트를 개발하고 운영합니다. 전사 공통 타겟팅 서비스인 BUDS(Baemin User Data System)를 중심으로, ML/AI/Agent/RAG/LLMOps 등 최신 AI 응용 기술을 적극적으로 활용합니다. 또한 LLM 기반 AI 기술 개발을 이끄는 BADA(Baemin Advanced Data Analytics)팀과의 협업을 통해 비즈니스 문제를 데이터 기반으로 해결하고 실질적인 가치를 창출하는 프로덕트를 제공하고 있습니다. 대표 서비스는 다음과 같습니다. 물어보새: LLM 기반 대화형 AI 에이전트로 사내 지식을 검색하고 Text-To-SQL 기술 등을 활용하여 데이터 기반 의사결정을 돕는 서비스, 배민360: 마케팅 및 영업 성과 개선을 위한 ML/AI 기반 고객 지수 및 세그먼트 서비스, BUDS: 푸드/커머스/라이더/사장님 회원 대상의 데이터 기반 타겟 마케팅을 위한 서비스. 우리는 국내(우아한형제들) 및 글로벌(Delivery Hero) 푸드/커머스 영역의 다양한 비즈니스 문제 해결과 기술 혁신을 목표로 실험과 도전을 반복하며 열린 마음으로 함께 성장할 동료를 찾고 있습니다. [업무내용] AI/ML 기반 서비스 개발 및 운영: RAG, Workflow, Agent 구조를 기반으로 실제 문제 해결에 기여하는 서비스를 개발합니다. 데이터 파이프라인 개발 및 최적화: AI/ML 모델에 활용할 수 있는 정형/비정형 데이터(예: 문서, 이미지 등)의 수집·가공·저장을 위한 데이터 파이프라인을 개발하고 운영합니다. LLMOps 환경 구축: 어플리케이션의 End-to-End 개발과 배포를 지원하는 환경을 설계하고 고도화합니다. 최신 AI 기술 리서치 및 내재화: 외부 오픈소스 및 최신 LLM/AI 기술을 조사하고 실서비스에 적합한 형태로 내재화합니다. [지원자격] AI/ML 플랫폼 또는 소프트웨어에 대한 이해와 5년 이상의 백엔드 또는 플랫폼 개발 경험이 있는 분, 데이터 파이프라인 설계·개발·운영한 실무 경험이 있는 분, Kubernetes 환경에서의 서비스 개발, 배포, 운영 경험이 있는 분, FastAPI 등 백엔드 프레임워크 기반의 API 서비스 개발 경험이 있는 분. [우대사항] LLM 기반 서비스 개발 경험(OpenAI, Claude, LLaMa 등 LLM 모델을 활용한 서비스 구현 경험, LangChain, LangGraph 등 LLM 프레임워크 활용 경험, RAG, VectorDB, Embedding을 활용한 검색 시스템 구축 경험, LLM 성능 실험 및 평가, 품질 모니터링 및 로깅 시스템 구축 경험, 글로벌 서비스 개발 및 운영 경험), 플랫폼 아키텍처 설계 및 개발 경험(MLOps 플랫폼 또는 데이터플랫폼 구축 및 운영 경험, 대규모 데이터 처리나 고트래픽 환경에서도 안정적인 시스템 운영 경험, 상황에 맞는 기술 스택 선택 및 문제 해결을 통한 비즈니스 가치 창출 경험, 시스템 아키텍처 설계, 코드 리뷰 등 팀 차원의 개발 문화 개선 경험), 데이터 및 인프라 운영 경험(Spark Streaming, Kafka Streams, Flink 등 대용량 실시간 데이터 처리 경험, AWS, GCP 등 퍼블릭 클라우드 환경에서 인프라 구축 및 운영 경험, CI/CD 및 모니터링 환경 구축과 운영 경험). [개발환경] 주요 기술: Python, Langchain, Langgraph, Spark, Redis, Flink, Kafka, Airflow, AWS, Kubernetes, Elasticsearch, FastAPI, VectorDB, Slack UI 개발. 업무 도구: GitLab, Jira, Confluence, Slack. 코드 리뷰: GitLab MR로 온라인 코드 리뷰 진행. 빌드, 테스트, 배포 자동화: GitLab CI, ArgoCD. 모니터링: Langfuse, MLflow, Prometheus, Grafana."
  },

  {
    "posting_id": 25,
    "company_id": 5,
    "position_id": 5,
    "content": "[업무내용] 머신러닝/Operations Research/데이터 분석 기술을 적용하여 딜리버리 프로세스를 서비스하는데 필요한 예측 모델을 구현하고 딜리버리 인프라를 동적으로 최적화, 딜리버리 인프라를 동적으로 최적화할 수 있는 Pricing 및 배차 최적화 프로젝트 수행, 딜리버리 프로세스의 이상을 실시간으로 탐지하거나 어뷰저를 탐지하기 위한 이상 탐지 프로젝트 수행, 신뢰성 높은 배달 소요시간 예측, 조리 소요시간 예측, 서비스 및 라이더 수요 예측 등 모델링 프로젝트 수행, 비즈니스 도메인 관점에서 프로덕트 목표에 맞는 문제를 정의하고 문제에 적합한 알고리즘 및 모델 개발 및 인사이트 도출, 프로덕트 개선을 위한 데이터 분석 업무 수행 👉 우아한형제들 개발자 직무인터뷰 바로가기 1편 / 2편. [지원자격] 수학/통계/산업공학/ML/DS/OR 관련 전공자 또는 그에 해당하는 강한 수학적 백그라운드와 경험을 갖추신 분, 5년 이상 실질적인 비즈니스 문제를 해결하기 위한 기법 또는 머신러닝을 적용한 경력을 보유한 분, 통계적 접근법과 Operations Research 분야 및 머신러닝 알고리즘에 대한 높은 이해력을 보유하신 분, 빠르게 변화하는 비즈니스 및 데이터 프로덕션 환경에서 서비스를 개선하는 데 도움이 되는 논문이나 기술들을 빠르게 학습하여 프로토타이핑할 수 있는 문제해결 능력을 갖추신 분, 논리적인 사고에 기반해 도메인에서 데이터가 의미하는 바를 연결하여 명확한 의사소통 및 문서화할 수 있으신 분, SQL/R/Python/Spark 언어를 활용한 데이터 정제, 분석, 모델링, 시각화할 수 있는 프로그래밍 경험을 보유하신 분, 빠른 주기로 순환하는 디지털 프로덕트 개발과 운영을 경험해 보신 분. [우대사항] 학술적인 연구 자료를 습득하여 비즈니스 문제 해결에 적용하는 능력이 뛰어나신 분, 확률론(Probability Theory)/확률 과정(Stochastic Process)에 대한 경험을 보유하신 분, 시계열 예측 알고리즘(ARIMA/RNN/LSTM/GRU 등)을 활용한 수요예측 경험을 보유하신 분, 베이지안 통계, 비모수 통계에 대한 경험을 보유하신 분, ML/DL/RS 프로덕트 서비스에 대한 대한 경험을 보유하신 분, Linear and Non-linear Programming/Integer and Combinatorial Optimization 문제를 해결한 경험을 보유하신 분, Airflow나 MLOps 환경에서 모델 개발/운영 경험을 보유하신 분, 딜리버리 또는 물류/공급망 운영에 대한 높은 수준의 지식을 보유하신 분"
  },

  {
    "posting_id": 26,
    "company_id": 6,
    "position_id": 1,
    "content": "이런 일을 해요: 게임화 요소(포인트, 뱃지, 레벨업) 구현, 데이터 기반 가설 검증을 위한 실험 환경 구축, 빠른 프로토타이핑과 지속적인 최적화를 통한 성장 동력 확보, 크로스 펑셔널 팀과 협업하여 비즈니스 임팩트 창출 / 이런 분을 찾고 있어요: 직접 서비스를 개발·운영한 경험, 모던 Frontend 개발에 대한 기본지식(WEB, HTML, CSS, REACT/VUE 등), JavaScript/TypeScript 능숙한 활용, RESTful·GraphQL 등 API 연동 및 상태 관리(Redux, Vuex 등) 경험, Git 협업 및 코드 리뷰 문화 적응 가능 / 이런 분이면 더 좋아요!: 그로스 마인드셋, 사용자 중심적 사고로 UX 개선점을 찾아내는 능력, 데이터 기반 의사결정에 대한 이해와 관심, 빠른 프로토타이핑과 MVP 개발에 대한 경험, 실험 문화에 대한 이해(A/B 테스트, 가설 검증 등), 크로스 펑셔널 팀(PM, 디자이너, 마케터)과의 협업 경험, 애자일/스크럼 개발 프로세스 경험, 빠르게 변하는 우선순위와 요구사항에 유연한 대응."
  },

  {
    "posting_id": 27,
    "company_id": 6,
    "position_id": 2,
    "content": "이런 개발 도구를 주로 사용하고 있어요: Kotlin, Golang, TypeScript, Kafka, AWS, GCP, Datadog, Kubernetes / 이런 문제를 해결하고 싶어요: 우리 팀은 당근의 엔지니어들이 각자의 팀에서 만들고자 하는 가치에 집중할 수 있도록 DX를 혁신하고 싶어요. 이를 위해서 다음 2가지 일에 집중해요. 당근의 다양한 엔지니어들이 가진 공통의 요구사항을 발견하고 이를 구현해요. 당근에는 수십 개의 팀과 각 팀에 속한 수백 명의 엔지니어가 있고 이들은 각자 다른 문제를 풀기 위해 고군분투하고 있어요. 우리 팀은 이들이 갖고 있는 공통의 요구사항을 발견하고 이를 구현하고자 해요. 우리의 노력으로 엔지니어의 고민 시간이 1분 줄어든다면 그들이 속한 모든 팀의 1분을 지켜주는 것이고 그렇게 팀의 생산성이 올라간다면 당근의 미션 달성에 한 발자국 더 다가설 수 있어요. 이러한 일을 한정된 리소스 내에서 해내기란 매우 도전적인 일이에요. 따라서 대단히 전략적인 접근이 필요하고, 특별한 전문성을 요구해요. 당근이 성장하면서 쌓아왔던 기술 부채를 효과적으로 관리해요. 짧은 시간 동안 서비스가 빠르게 성장하면서 기술적인 의사결정이 필요한 순간마다 개발팀은 최선의 선택을 하기 위해 노력했어요. 모든 의사결정에는 트레이드오프가 따르고 이는 시기와 문제의 규모에 따라서 피할 수 없는 장애가 될 수도 있어요. 이러한 리스크를 해소하기 위해 쌓아올린 기술 부채를 탐색하고 필요하다면 해결하는 액션을 실행해요. 따라서 지난한 문제를 풀어본 경험과 노하우가 필요해요. 다른 소프트웨어 엔지니어링 직무와 마찬가지로 일상적인 업무는 테크스펙 및 소스코드 작성과 리뷰, 테스트 그리고 배포 및 운영 등 소프트웨어 개발의 라이프사이클 전체를 포함해요. 다만, 전사 영향도가 있는 복잡한 문제를 전략적으로 접근할 수 있는 경험을 할 수 있어요 / 이런 분과 문제를 해결하고 싶어요: 우리 팀은 플랫폼 및 백엔드 애플리케이션을 만드는 엔지니어링 팀이에요. 지원자로서 아래의 모든 것에 숙달해야 하는 것은 아니지만 팀에 합류한다면 필요에 따라 깊은 수준으로 이해하고 적용할 수 있어야 해요. Kafka를 활용하는 백엔드 애플리케이션을 작성하는 데 익숙하고, Kafka의 동작 원리 또한 이해하고 계신 분, 스키마 레지스트리 등을 사용해 Kafka와 같은 메시징 시스템을 잘 활용했던 경험이 있으신 분, 서버 애플리케이션 개발의 라이프사이클 전체에 익숙하고 이러한 프로젝트를 수행하는 것을 두려워하지 않으시는 분, REST, gRPC 등의 통신 모델을 이해하고, 컨슈머 중심의 API를 설계하는 것과 아닌 것의 차이를 알고 있으며 잘 설계된 API를 지속해서 확장하고 성장시키는 기회를 즐기시는 분, AWS, GCP, Kubernetes 등 클라우드 및 분산 컴퓨팅 환경에서 백엔드 애플리케이션을 개발하는 것에 익숙하신 분, 레거시 소프트웨어와 이를 개발한 엔지니어의 선택을 존중하며 공감할 수 있고 그들의 선택을 더 나은 방향으로 개선할 수 있는 결정을 내릴 수 있는 분, 소프트웨어 엔지니어링은 단순히 소스코드를 작성하는 것 이상으로, 시간의 흐름에 따라 변화하고 발전하는 소프트웨어를 관리하는 정책, 도구, 그리고 모범 사례를 포괄하는 개념이라고 생각하시는 분, 소프트웨어 엔지니어링 경험이 2년 이상이신 분 / 이런 성장을 이룰 수 있어요: 공통서비스개발팀은 각 구성원이 다음과 같은 성장을 이룰 수 있다고 믿어요. 대규모 트래픽을 다루는 플랫폼 및 백엔드 전문가로 성장할 수 있어요. 대규모 트래픽을 가진 서비스의 근간에는 어떠한 문제들이 있고 이를 어떻게 다루고 해결하는지를 경험할 수 있어요. 계속해서 성장하고 있는 서비스인 만큼 문제의 유형도 다양하고 복잡해요. 난이도가 높지만 그만큼 해결했을 때의 기쁨도 우리가 누리게 될 성장의 기울기도 높을 것이라고 믿어요. 소프트웨어 엔지니어링을 깊이 있게 이해하는 엔지니어로 성장할 수 있어요. 한정된 리소스를 활용하여 어떻게 임팩트가 가장 큰 결과물을 만들 수 있을지 끊임없이 고민해볼 수 있어요. 그리고 더 나은 소프트웨어 엔지니어링을 실현하기 위해 기존의 관습에 저항하고 새로운 방식들을 끊임없이 시도해볼 수 있어요. 리더십을 경험해볼 수 있어요. 목표를 달성하기 위한 태스크를 스스로 정의하고 최종 결과물까지 자기주도적으로 만드는 경험을 할 수 있어요. 이 때 혼자가 아닌 팀으로서 동료들의 성장에 기여하고 필요에 따라 각자 스스로가 리더십을 발휘할 수 있도록 성장할 수 있어요."
  },

  {
    "posting_id": 28,
    "company_id": 6,
    "position_id": 3,
    "content": "이런 일을 해요: 광고 상품에 필요한 스펙을 기획하고 고도화해요, 데이터를 기반으로 가설을 실험하고 핵심지표를 개선해요, 광고 상품의 성과를 높이기 위한 최적화 도구를 도입하고 광고 모델링을 개선해요, 서비스 및 플랫폼 부서와 협업을 주도하며 프로젝트를 매니징해요 / 이런 분을 찾고 있어요: PM 경력 5년 이상이신 분, 광고 상품 및 플랫폼 기획 2년 이상이신 분, Programmatic 광고에 대한 관심과 기술적 이해도가 높으신 분 / 이런 분이면 더 좋아요!: 광고 상품 전반을 기획하고 출시까지 진행해 본 경험이 있으신 분, 다양한 이해관계자와 함께 커뮤니케이션하며 프로젝트를 진행한 경험이 있으신 분, 온라인 광고 플랫폼 및 광고 비즈니스 생태계에 대한 이해도가 높으신 분, 자기주도적으로 일하시고 긍정적인 마인드를 보유하신 분, 비즈니스 데이터를 분석하는 역량을 갖추신 분."
  },

  {
    "posting_id": 29,
    "company_id": 6,
    "position_id": 4,
    "content": "이런 일을 해요: 최신 AI 기술(LLM, 생성형 AI, 머신러닝 등)을 기반으로 혁신적인 제품 기능 및 솔루션을 기획, 설계, 개발하고 실제 서비스에 적용해요, LLM의 동작을 분석하고 이해하여 효과적인 프롬프트를 설계하고 지속해서 실험하며 개선해요, AI 시스템 성능을 측정하고 개선하기 위한 평가 프레임워크를 구축해요, AI 기술의 빠른 변화에 발맞춰 새로운 기술, 논문, 도구 등을 지속해서 학습하고, 실제 문제 해결에 적용할 가능성을 탐색해요, 백엔드 엔지니어, 프로덕트 매니저 등 다양한 분야의 동료들과 긴밀하게 협력하여 아이디어를 구체적인 제품으로 완성해요, 다양한 아이디어를 신속하게 프로토타이핑하고, 사용자 피드백과 데이터를 기반으로 반복적으로 개선해나가요 / 이런 분을 찾고 있어요: 컴퓨터 과학, 소프트웨어 공학, AI 관련 분야 학사 이상 학위 또는 그에 준하는 실무 경험을 보유하신 분, Python 언어를 능숙하게 사용하고 실제 서비스 수준의 소프트웨어 개발 경험이 있으신 분, LLM을 활용한 애플리케이션 개발 또는 프롬프트 엔지니어링 경험이 풍부하신 분, 프로덕션 환경에서 RAG 시스템 구현한 경험이 있으신 분, 새롭고 정의되지 않은 문제에 직면했을 때 모호함을 명확함으로 바꾸는 문제 정의 능력을 갖추신 분, 주도적으로 해결책을 찾아 나갈 수 있는 분석적 사고 및 문제 해결 능력을 갖추신 분, 개발 과정, 시스템 아키텍처, 실험 결과 등을 명확하게 문서화하고 팀 내외부에 효과적으로 공유할 수 있으신 분 / 이런 분이면 더 좋아요!: AWS, GCP, Azure 등 클라우드 플랫폼 환경에서 AI 모델을 개발하고 배포해 본 경험이 있으신 분, AI 에이전트 아키텍처 및 오케스트레이션 시스템 개발 경험이 있으신 분, 프론트엔드와 백엔드 시스템 모두를 풀스택으로 개발한 경험이 있으신 분, LLM을 활용한 애플리케이션의 평가를 설계하고 평가 프로세스를 자동화한 경험이 있으신 분."
  },

  {
    "posting_id": 30,
    "company_id": 6,
    "position_id": 5,
    "content": "데이터 가치화 팀은 “매일 데이터를 통해 사용자를 위한 의사결정을 해요.”라는 비전을 달성하기 위해 모였어요. 이 가슴 뛰는 비전을 달성하기 위해 Data Scientist, Decision과 Software Engineer, Data로 이루어진 목적 조직을 만들었고, 데이터 가치화의 문제를 주도적으로 해결하기 위해 고민해요. Software Engineer, Data는 데이터를 가치화하는 과정에서 발생하는 문제들을 소프트웨어 엔지니어링을 통해 해결해요. 빠르게 성장하는 당근에 발맞추어 미래에 병목이 되지 않을 데이터 시스템을 설계하고, 자동화된 테스트와 시스템에 대한 관측성 확보를 통해 데이터의 신뢰성을 지켜내요. 또한 당근의 구성원들이 데이터를 통해 사용자를 이해하는 과정에서 생기는 기술적 문제를 해결하고, 데이터 제품(지표 플랫폼, 실험 플랫폼 등)을 통해 당근의 데이터 기반 의사결정(Data-informed decision-making)을 폭발적으로 성장시켜요. 견고한 소프트웨어 엔지니어링을 기반으로 당근에서 고품질의 데이터가 병목 없이 흐르며 가치를 만들어낼 수 있도록 하는 것이 데이터 가치화 팀 엔지니어들의 미션이에요. 이런 일을 해요: 고성능의 확장 가능한 데이터 처리 시스템(배치/스트리밍)을 설계해요, 안정적이고 테스트 가능한 데이터 파이프라인을 설계하고 운영해요, 구성원들이 이벤트를 쉽게 추가할 수 있도록 자동화된 이벤트 로깅을 구현하고 대용량의 이벤트를 유실 없이 안정적으로 수집할 수 있는 로그 시스템을 만들어요, 전사 구성원들의 데이터 기반 의사결정을 돕는 데이터 제품(지표 플랫폼, 실험 플랫폼 등)을 개발하고 지속적으로 개선해요, 전사 구성원들이 데이터를 신뢰하고 사용할 수 있도록 데이터 시스템의 관측성(Observability)을 지속적으로 확보하고 자동화된 데이터 품질(Quality) 체크를 통해 문제를 조기에 발견하고 해결해요 / 이런 분을 찾고 있어요: 하나 이상의 프로그래밍 언어에 능숙하신 분(Python / Java / Scala / Kotlin / Go 등), 대규모 트래픽 처리를 위한 확장 가능한 데이터 아키텍처의 구성에 대한 관심이 있으신 분, AWS, GCP 등 클라우드 환경에서 개발/운영 경험이 있거나 그에 준하는 지식을 갖추신 분 / 이런 분이라면 더 좋아요!: Spark, Flink, Beam, BigQuery 등 빅데이터 프레임워크 사용 경험이 있으신 분, 분산 환경에서 대용량 데이터 처리(배치/스트리밍) 경험이 있으신 분, Kubernetes 등 컨테이너 오케스트레이션 시스템을 활용한 운영 경험이 있으신 분, AWS, GCP 등 클라우드 환경에서 IaC를 활용한 데이터 인프라 설계 및 운용 경험이 있으신 분."
  },

  {
    "posting_id": 31,
    "company_id": 7,
    "position_id": 1,
    "content": "Android, iOS 앱의 웹뷰에서 동작하는 모바일 제품과 PC 브라우저에서 동작하는 데스크탑 제품, 운영을 위한 백오피스까지 모두 모던 웹 기술로 만들고 있어요. 어렵고 복잡한 투자 상품을 누구나 쉽게 이용할 수 있도록 슬릭한 투자 경험을 제공하는 서비스를 만들고 있어요. 수많은 실시간 데이터를 끊김없이 보여주고 거래할 수 있도록 최적의 엔지니어링 기술을 활용하고 있어요. 합류하면 함께할 업무예요: 토스증권의 모든 서비스에서 사용되는 디자인 시스템, 인터랙션, 비주얼 요소를 설계하고 개발하는 PC Design Platform Team 에서 일해요, 토스증권의 서비스를 개발할 때 사용되는 디자인 시스템을 개발하고 유지보수해요, 디자인 시스템이 일관성 있으면서도 확장성 있는 인터페이스를 제공하기 위한 원칙과 구조를 고민해요, 프론트엔드 개발의 생산성을 높이는 다양한 라이브러리와 협업 도구를 제작해요 / 이런 분과 함께하고 싶어요: React 등 SPA 프레임워크 사용에 능숙하신 분이면 좋아요, UI/UX에 대해 높은 가치를 두고 있는 분을 찾아요, 브라우저의 동작원리를 이해하고 고성능의 컴포넌트를 구현할 수 있는 역량이 필요해요, UI와 애니메이션을 재사용하기 쉽게 패턴화하여 라이브러리로 만들어낼 수 있는 뛰어난 개발 역량이 필요해요, 단순히 주어진 개발을 해내는 것보다 주도적으로 문제를 발견하고 분석해 솔루션을 제안할 수 있는 분과 함께하고 싶어요 / 이력서는 이렇게 작성하시는 걸 추천해요: 반응형 디자인, 웹 접근성, 웹 표준을 고려한 UI 개발 경험이 있으면 기술해주세요, Apple HIG, Material Design 등 UI/UX 가이드에 대한 이해가 깊은 분이면 좋아요, Sketch, Figma, Framer 등 디자인 툴을 사용한 경험이 있다면 소개해주세요, 오픈소스 라이브러리를 개발하고 유지보수한 경험이 있으면 기술해주세요 / 이런 기술을 사용하고 있어요: 언어/프레임워크 - TypeScript, React, Next.js / 스타일링 - Emotion, Sass, Framer-motion, GSAP / 빌드 툴링 - webpack, ESBuild, Vite / 패키지 매니저 - Yarn, pnpm / CI/CD - GitHub Actions, CircleCI."
  },

  {
    "posting_id": 32,
    "company_id": 7,
    "position_id": 2,
    "content": "합류하면 함께할 업무예요: 복잡한 은행 시스템을 빠르고 간결한 구조로 고객에게 제공할 수 있는 방법에 대해 고민하고 실행해요, 고객에게 좋은 경험을 제공할 수 있도록 빠르고 유연하며 확장이 용이한 시스템을 개발해요, 대용량 트래픽을 빠르고 안정적으로 처리할 수 있도록 튼튼하고 안전한 시스템을 개발해요, 혁신적인 뱅킹 서비스를 위한 아이디어를 먼저 제안하고 실제 서비스를 설계부터 개발까지 할 수 있어요, 대고객 서비스와 함께 뱅킹 시스템 혁신을 위한 내부 관리 웹 서비스를 개발하기도 해요 / 이런 분과 함께하고 싶어요: Kotlin/Java로 Spring Framework 기반의 서비스를 개발한 경험이 있는 분이 필요해요, 비즈니스 요건을 빠르게 이해하고 능숙하게 데이터 모델과 API를 디자인할 수 있는 분이 필요해요, 변화를 두려워하지 않고 지속적인 성장을 원하시는 분이면 잘 맞으실 거예요, 동료에게 필요한 지식을 전파하고 협업을 즐기시는 분이면 좋아요, 대용량 트래픽을 안정적으로 운영해본 경험이 있는 분이면 좋아요, Redis와 Kafka를 다뤄본 경험이 있는 분이면 좋아요 / 이력서에는 아래 내용을 꼭 포함해 주세요: 실제 본인이 참여한 프로젝트와 기여 정도, 어려운 과제를 극복한 과정이 드러날 수 있는 구체적인 사례가 최소 1가지 이상 필요해요, 서비스 개발을 담당하는 만큼 문제 해결 역량을 중요하게 생각하고 있어요. 마주한 문제를 정의하고 이를 해결하기 위해 어떤 시도를 했는지, 나아가 그 결과는 어땠는지 등이 확인될 수 있도록 문제 해결의 과정을 상세하게 적어주세요, 대규모 트래픽을 다뤄보신 경험 또는 기존 대비 더 나은 결과를 위해 개선을 시도해 보신 경험이 있다면 꼭 공유해 주세요, 개발자로서 어떤 성장을 생각하고 계시고 성장을 위해 어떤 노력을 하고 계신지 적어주세요 / 토스뱅크에서 사용하는 기술: Kotlin, Java, Gradle, Netty, Spring Mvc, Spring Webflux, Spring Boot, Spring Cloud Gateway, Spring Cloud Config, JPA/Hibernate, MySQL, MongoDB, Redis, Zookeeper, Kubernetes + Istio, GoCD, ArgoCD, Consul, Vault, Git, Docker, Ceph, Harbor, Kafka, ELK, Prometheus + Thanos, Grafana."
  },

  {
    "posting_id": 33,
    "company_id": 7,
    "position_id": 3,
    "content": "합류하면 함께할 업무예요: 프로덕트에 관련한 모든 사안에 대해 최종 의사 결정 권한을 가지고, 개발·제휴·결제 기능 확산 등 전반에 걸쳐 제품을 주도하는 역할이에요, 프로덕트의 핵심 지표 정의에서부터 비즈니스 모델 설계, 액션 아이템 추진 및 결과 도출까지 서비스의 생애 주기를 오롯이 담당하며 제품의 성장을 드라이브합니다, 유효한 가설을 수립하고 실험을 통해 도출된 Data Insight를 기반으로 가설을 검증하며 끊임없는 Iteration을 통해 Product-Market Fit을 찾고 제품을 고도화하게 돼요, 사업의 방향·매출·수익 등에 대한 결정권을 가지고 목표 설정과 전략도 스스로 수립하게 돼요. 이 과정에서 사일로 구성원들과 충분한 논의 과정을 거쳐 ‘가장 좋은 방향’을 결정하게 돼요, 작은 스타트업의 CEO와 같이 진짜 사업을 해볼 수 있는 역할이에요. 위에서 내려오는 방향에 따라 진행하지 않고, 직접 부딪혀서 해결해야 하는 문제를 정의하고 다양한 액션을 통해 성공과 실패를 맛볼 수 있어요, 담당하는 제품의 목표와 제품팀(silo)의 비전을 세우고 사용자들이 토스 앱에서 느꼈던 제품 경험을 넘어서는 오프라인 서비스를 만들어낼 수 있어요 / 이런 분과 함께하고 싶어요: 애자일한 프로세스로 성과를 만들거나 실패한 경험이 있으신 분이 필요해요, 문제 해결을 위해 정의한 비전·전략·미션부터 비즈니스 임팩트까지 연결되는 과정이 논리적이고 합리적인 분이 필요해요, 데이터를 기반으로 다양하고 복잡한 문제를 해결하는 Analytic Mindset이 필요해요, 고객의 입장에서 문제를 정의하고 해결해 본 경험이 있으면 좋아요, 사업/제품 기획부터 조직 운영까지 스타트업의 A to Z를 다뤄보신 창업 경험이 있으면 좋아요, 카드사·VAN사 등과 간편결제 연동 개발 경험이 있으면 좋아요 / 이력서는 이렇게 작성하시는 걸 추천해요: 담당해오신 Product/Service/Project 별 문제 정의–가설 수립–액션 및 검증–결과의 요소들이 명확히 정의돼야 해요, 해오신 업무의 단순 나열이 아닌 임팩트 및 러닝 포인트가 파악되어야 해요, 본인이 직접적으로 기여하여 수치적으로 성과를 달성해 보신 경험이나 사업적 지표 또는 기술적 개선 여부를 표현해 주세요, 본인의 프로덕트 경험 중 성공/실패로 판단한 기준을 객관적이고 논리적으로 작성해 주세요, 카드사 및 VAN사와의 간편결제 연동 개발 경험이 있으시다면 디테일하게 표현해 주세요."
  },

  {
    "posting_id": 34,
    "company_id": 7,
    "position_id": 4,
    "content": "합류하게 될 팀에 대해 알려드려요: MLE(AI) 포지션으로 지원하시면 LLM Service 팀이나 Commerce AI 팀에 속해요, LLM, RAG, 멀티모달 등 다양한 AI 기술을 활용해 문제를 정의하고 기술적으로 접근하는 방식 자체를 설계해요, AI로 이미 존재하는 문제를 푸는 데서 멈추지 않고 문제 자체를 새롭게 정의하고 확장해 나가는 팀이에요, 팀에서는 다양한 LLM 응용을 안전하고 편리하게 사용하기 위한 보안성, 사용성을 보장해 주기 위한 업무와 토스의 업무 방식을 근본적으로 바꾸기 위한 도전적인 장기 목표를 구현하려 노력하고 있어요 / 합류하면 담당하게 될 서비스를 소개해 드려요: 특정 도메인에 관심이 깊거나 관련 경험이 있다면 상세 채용공고를 통해 지원해주시고, 현재 페이지에서 지원하실 경우 인터뷰를 통해 지원자분의 강점을 확인하고 그에 맞는 조직을 추천해 드릴게요 / 💡 RAG/Agent: ML Engineer(RAG)는 LLM Service 팀이 풀고자 하는 문제 중에 참조 정보를 가장 정확하고 효율적으로 얻어내는 기술에 대한 전문성이 필요해요, LLM Workflow를 구축하는 과정은 누구나 할 수 있으며 이 중 정보 획득과 조합이 필요한 문제를 해결할 때 과학적으로 성능을 검증할 수 있는 분이 필요해요, Agent 개발 직무는 기본적인 LLM workflow 구현부터 복잡한 분산형 Agent System 구축의 역할을 하며, Agentic Silo 구현에 대한 책임을 가지고 가상의 Silo를 만드는 문제에 도전해요 / 💡 LLM Model: Model 구현 직무는 토스팀에 필요한 LLM(VLM), Embedding, ReRanker 모델에 대한 DRI를 가져요, 토스 팀이 원하는 모델을 적시에 제공하며 어떤 모델이 최적의 선택인지를 제안해야 해요, Financial Dataset을 구축하고 금융에 최적화된 LLM(VLM) 모델을 만드는 역할을 해요 / 💡 Commerce AI: 텍스트, 이미지, 구조화된 데이터 등 다양한 형태의 정보를 유기적으로 활용해 커머스 도메인의 복잡한 문제를 모델링하고 해결해요, LLM, RAG, 멀티모달 모델 등을 활용해 기존 방식으로는 풀기 어려웠던 과제에 새로운 접근을 시도하고, 명확히 정의되지 않았던 영역에 AI를 적용할 수 있는 가능성도 탐색해요, 설계한 모델은 오프라인/온라인 실험과 정량 평가를 통해 효과를 검증하고 반복적인 개선 루틴을 운영하며 기술적 정교함뿐 아니라 비즈니스 적용 가능성과 지속 가능성까지 고려한 솔루션을 설계해요 / 이런 분과 함께하고 싶어요: LLM, RAG, 멀티모달 모델 등 최신 AI 기술을 활용해 복잡한 문제를 해결한 경험이 필요해요, 다양한 형태의 데이터(텍스트, 이미지, 구조화 데이터)를 통합적으로 활용해 모델을 설계하고 실험해 본 분이 필요해요, 문제 정의부터 모델 설계, 실험, 정량 평가까지 전체 과정을 주도한 경험이 있으면 좋아요, PyTorch, Hugging Face Transformers, LangChain 등 최신 AI 생태계에 익숙해야 해요, LLM을 활용한 에이전트 구현 경험이 많고 다양한 실패와 성공을 경험하신 분이면 좋아요, 에이전트 구성과 관련된 프레임워크를 이해하고 복잡한 유스케이스에 적용 가능한 분이면 좋아요, 오픈소스 LLM을 활용하여 유스케이스를 개발하거나 커스터마이징한 경험이 있으신 분이면 좋아요, 하이퍼파라미터 튜닝과 최적화에 대한 깊이 있는 이해가 있으신 분이면 좋아요, 복잡한 모델 아키텍처와 성능을 쉽게 설명할 수 있는 커뮤니케이션 역량을 갖추신 분이면 좋아요, 대규모 언어 모델(LLM)을 튜닝하거나 파인튜닝 경험이 있으신 분이면 좋아요 / 이력서는 이렇게 작성하시는 걸 추천해요: 단순한 모델링 기술 나열보다는 무엇을 개선하고 어떤 영향을 주었는지를 구체적으로 보여주시면 좋아요, 다양한 데이터나 제약 조건 속에서 실험과 반복 개선을 통해 의미 있는 성과를 만들어낸 경험이 있다면 강조해 주세요, 협업 과정에서 어떤 역할을 했는지, 기술 외적으로도 문제 해결에 어떻게 기여했는지 드러나면 더 좋습니다."
  },

  {
    "posting_id": 35,
    "company_id": 7,
    "position_id": 5,
    "content": "합류하면 함께 할 업무예요: 대출 니즈 모형, 카드 발급 예측 모형, 신용평가 모형 등 신용과 대출 도메인 영역에서 유저에게 맞춤형 서비스를 제공하기 위한 다양한 ML 모델을 개발해요, Data Mining / Machine Learning / Deep Learning 기술들을 활용하여 새로운 가치를 발굴해 비즈니스 고도화에 기여해요, 신규 서비스 및 사업 영역의 발굴을 위해 다양한 데이터에 대한 분석 및 탐색을 진행해요, 빠르게 변화하는 비즈니스 성장 전략과 방향성에 맞도록 모델을 고도화하고 최적화를 수행해요 / 이런 분과 함께하고 싶어요: 개인 혹은 개인사업자의 대안/신용평가모델(CSS)을 개발해 내재화하신 경험이 필요해요, 신용평가모형 개발 환경, 제도, 규제에 대한 이해를 바탕으로 독립적이고 주도적인 모델링 경험이 필요해요, 복잡한 원천 데이터로부터 데이터 정제 작업을 직접 해보신 경험이 필요해요, Python, SQL 등의 언어를 능숙하게 다룰 수 있는 분이 필요해요, Machine Learning / Deep Learning 등 최신 알고리즘을 활용한 실제 비즈니스 문제 해결 경험이 필요해요, 다양한 최신 기술에 관심이 있고, 새로운 것을 학습하고 성장하기를 원하시는 분이 필요해요 / 이력서는 이렇게 작성하시는 걸 추천해요: 현재 채용 공고와 관련 있었던 업무/프로젝트, 그 결과에 대해 구체적으로 작성해주세요, 프로젝트에서 어떤 모델을 사용했는지 구체적으로 작성해주세요, Machine Learning 모형을 직접 개발하고 서비스에 적용해 본 경험이 있다면 구체적으로 작성해주세요, 기술적으로 외부 공개가 민감한 사항일 경우 해당 부분은 제외해주세요."
  }
]
